# Shell extension to jump to frequently used directories
brew "autojump"
# Modern, maintained replacement for ls
brew "eza"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Shell extension to navigate your filesystem faster
brew "zoxide"
vscode "andenetalexander.vim-cheatsheet"
vscode "bnavetta.zoterolatex"
vscode "fisheva.eva-theme"
vscode "geoffkaile.latex-count"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "james-yu.latex-workshop"
vscode "lenagain.latexindent"
vscode "marp-team.marp-vscode"
vscode "mblode.zotero"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "olga-f.light-color-theme"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "rickaym.manim-sideview"
vscode "vscodevim.vim"
